app/controllers/back_office_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def newservice

    if session[:user_id] != nil then

      user = User.find(session[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `tags` (`service_id`, `tag`, `created_at`, `updated_at`) VALUES (1, 'pessoas', '2011-05-19 17:23:00', '2011-05-19 17:23:00')
INSERT INTO `inf_entities` (`service_id`, `entity`, `created_at`, `updated_at`) VALUES (1, '\n		', '2011-05-19 17:23:00', '2011-05-19 17:23:00')
---
  def createservice

    if session[:user_id] != nil then

      user = User.find(session[:user_id])

     if user.notAnonymus == '-100'

        @url = params[:url]
        @icon = params[:service]

        @doc = Nokogiri::XML(open(@url), nil, 'UTF-8')
        @name = @doc.root['name']
        url = @doc.root['url']
        puts @doc
        puts @doc.at_css("provider")
        provider = @doc.at_css("provider").text()
        type = @doc.at_css("type").text()
        tags = @doc.xpath("//tag")
        stags = []

        tags.each do |tag|
          stags << tag.text()
        end

        search = @doc.at_css("search").text()
        refentities = @doc.at_css("referedEntities").children()
        refent = []

        refentities.each do |entity|
          refent << entity.text()

INSERT INTO `competences` (`service_id`, `competenceType`, `competenceUrl`, `description`, `created_at`, `updated_at`) VALUES (1, 'Home', 'http://DominioGeral/services/people/index', 'Devolve a descrição do serviço', '2011-05-20 17:51:21', '2011-05-20 17:51:21')
---
        competences.each do |competence|
          acomp = []
          if competence['path'] != ""
            acomp << competence['path']

INSERT INTO `services` (`serviceName`, `provider`, `servicetype`, `ranking`, `url`, `imgPath`, `created_at`, `updated_at`) VALUES ('people', 'G6', 'academics', 0, 'http://DominioGeral/services/people', 'TODO', '2011-05-19 17:23:00', '2011-05-19 17:23:00')
---
        end

        if @icon != nil
          Service.create :serviceName => @name, :provider => provider, :servicetype => type, :ranking => 0, :url => url, :icon => @icon["icon"]

SELECT `services`.* FROM `services` WHERE `services`.`serviceName` = 'people'
---
          Service.create :serviceName => @name, :provider => provider, :servicetype => type, :ranking => 0, :url => url
        end

        service = Service.where(:serviceName => @name)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `services`.* FROM `services`
SELECT `competences`.* FROM `competences`
---
  def listservices

    if session[:user_id] != nil then

      user = User.find(session[:user_id])

       if user.notAnonymus == '-100'

          @services = Service.all
          @competences = Competence.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
SELECT `services`.* FROM `services` WHERE `services`.`id` = 2 LIMIT 1
DELETE FROM `services` WHERE `services`.`id` = 2
SELECT `competences`.* FROM `competences` WHERE `competences`.`service_id` = 1
SELECT `competences`.* FROM `competences`
DELETE FROM `competences` WHERE `competences`.`id` = 1
SELECT `ref_entities`.* FROM `ref_entities` WHERE `ref_entities`.`service_id` = 4
DELETE FROM `ref_entities` WHERE `ref_entities`.`id` = 36
SELECT `tags`.* FROM `tags` WHERE `tags`.`service_id` = 4
DELETE FROM `tags` WHERE `tags`.`id` = 10
---
  def destroyservice

    if session[:user_id] != nil then

      user = User.find(session[:user_id])

      if user.notAnonymus == '-100'

        @id = params[:id]

        @service = Service.find(@id)
        @service.destroy

        @competences = Competence.where(:service_id => @id)
        @competences.each do |competence|
          competence.destroy
        end

        @refent = RefEntity.where(:service_id => @id)
        @refent.each do |ent|
          ent.destroy
        end

        @infent = InfEntity.where(:service_id => @id)
        @infent.each do |ent|
          ent.destroy
        end

        @tags = Tag.where(:service_id => @id)
        @tags.each do |tag|
          tag.destroy