app/controllers/home_page_controller.rb

  def index

    if current_user == nil then

      name = "Anonymus"+rand(100000).to_s
      User.create :userName => name, :password => name, :email => name, :notAnonymus => "no"
      users = User.where(:userName => name)
      session[:user_id] = users[0].id

    end

    @services = Service.all
---
INSERT INTO `users` (`userName`, `email`, `passwordHash`, `passwordSalt`, `activateCode`, `notAnonymus`, `created_at`, `updated_at`) VALUES ('Anonymus69019', 'Anonymus69019', '$2a$10$wJV.SLo5SNITjks7BbuFgu2laM6b.jsoTf5UH5GqWpGy/Yrj93d.S', '$2a$10$wJV.SLo5SNITjks7BbuFgu', NULL, NULL, '2011-05-30 19:10:21', '2011-05-30 19:10:21')
SELECT 1 FROM `users` WHERE (`users`.`userName` = BINARY 'Anonymus31494') LIMIT 1
SELECT `services`.* FROM `services`