app/controllers/search_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
---
   def search

    require 'cgi'

    text = CGI.escape(params[:keyword].to_s)
    @keyword =  text.gsub("%", "\%").gsub("_", "\_").gsub(" ", "+")
    @start = (params[:start] || '1').to_i
    @end = (params[:end] || '7').to_i
    @type = params[:type]
    @entity = params[:entity]
    counter = 1


    user = User.find(session[:user_id])