app/controllers/search_controller.rb

   def search
    require 'cgi'

    text = CGI.escape(params[:keyword].to_s)
    @keyword =  text.gsub("%", "\%").gsub("_", "\_").gsub(" ", "+")
    @start = (params[:start] || '1').to_i
    @end = (params[:end] || '20').to_i
    @type = params[:type]
    @entity = params[:entity]
    counter = 1

    if session[:user_id] != nil then
      History.create :user_id => :user_id, :time => Time.now, :description => "Search: "+params[:keyword], :url => "http://localhost:3000/search?keyword="+params[:keyword]+"&start="+@start.to_s+"&end="+@end.to_s
    end

    if @type != nil then
      services = Service.where(:servicetype => @type).order(:ranking)
    elsif @entity != nil then
      entities = InfEntity.where(:entity => @entity)
      services = []
      entities.each do |entity|
        services << entity.service
      end
    else

    services = Service.order(:ranking)
    end
    list = []
    flag = 1
    services.each do |service|
      competence = service.competences.where(:competenceType => "Search")
---
INSERT INTO `histories` (`user_id`, `time`, `description`, `url`, `created_at`, `updated_at`) VALUES (1, '2011-05-29 15:21:38', 'Search: Teoria de Sinais', 'http://localhost:3000/search?keyword=Teoria de Sinais&start=1&end=20', '2011-05-29 15:21:38', '2011-05-29 15:21:38')
SELECT `services`.* FROM `services` WHERE `services`.`servicetype` = 'academic' ORDER BY ranking
SELECT `inf_entities`.* FROM `inf_entities` WHERE `inf_entities`.`entity` = 'p'
SELECT `services`.* FROM `services` WHERE `services`.`type` = 'puta' ORDER BY ranking
SELECT `services`.* FROM `services`
SELECT `competences`.* FROM `competences` WHERE `competences`.`competenceType` = 'Search' AND (`competences`.service_id = 1)

  def servicesearch
    require 'cgi'

    text = CGI.escape(params[:keyword].to_s)
    @keyword =  text.gsub("%", "\%").gsub("_", "\_").gsub(" ", "+")
    @start = (params[:start] || '1')
    @end = (params[:end] || '20')
    @servicename = params[:service]
    service = Service.where(:serviceName => @servicename)
    competence = service[0].competences.where(:competenceType => "Search")
---
SELECT `services`.* FROM `services` WHERE `services`.`serviceName` = 'service'
SELECT `competences`.* FROM `competences` WHERE `competences`.`competenceType` = 'Search' AND (`competences`.service_id = 1)