app/controllers/service_forward_controller.rb

SELECT `services`.* FROM `services` WHERE `services`.`serviceName` = 'people'
SELECT `competences`.* FROM `competences` WHERE `competences`.`competenceType` = 'Home' AND (`competences`.service_id = 6)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def homepagerequest

    @servicename = params[:service]
    service = Service.where(:serviceName => @servicename)
    competence = service[0].competences.where(:competenceType => "Home")
    homeurl = service[0].url

    user = User.find(session[:user_id])

SELECT `services`.* FROM `services` WHERE `services`.`serviceName` = 'People'
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def listrequest

    @servicename = params[:service]
    @method = params[:method]
    service = Service.where(:serviceName => @servicename)
    serviceurl = service[0].url

    user = User.find(session[:user_id])

SELECT `services`.* FROM `services` WHERE `services`.`serviceName` = 'CursosCadeiras'
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `histories` (`user_id`, `time`, `description`, `url`, `created_at`, `updated_at`) VALUES (1, '2011-05-29 15:07:10', 'Record: Professor', 'http://localhost:3000/services/people/people/437', '2011-05-29 15:07:10', '2011-05-29 15:07:10')
---
  def recordrequest

    @servicename = params[:service]
    @id = params[:id]
    @method = params[:method]

    address = get_address
    @url = address+"services/"+@servicename+"/"+@method+"/"+@id

    service = Service.where(:serviceName => @servicename)
    serviceurl = service[0].url

    user = User.find(session[:user_id])
    if user.notAnonymus != nil
      @logged = "true"
    else @logged = "false"
    end

    link = serviceurl + "/" +@method+"/"+@id
    puts link
    @doc = Nokogiri::XML(open(link), nil, 'UTF-8')

    record = @doc.at_css("record")
    title = record['title']

    record['logged'] = @logged
    record['url'] = @url

    if session[:user_id] != nil then
      History.create :user_id => session[:user_id], :time => Time.now, :description => "Recurso: "+title, :url => get_address + "services/"+@servicename+"/"+@method+"/"+@id