app/controllers/services_controller.rb

SELECT `services`.* FROM `services`
---
  def index
    @services = Service.all

SELECT `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
---
  def show
    @service = Service.find(params[:id])

SELECT `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
---
  def edit
    @service = Service.find(params[:id])

INSERT INTO `services` (`serviceName`, `provider`, `type`, `ranking`, `url`, `imgPath`, `created_at`, `updated_at`) VALUES ('People', 'G06', NULL, NULL, 'http://localhost:3001', 'nao ha ainda', '2011-05-09 10:43:20', '2011-05-09 10:43:20')
---
  def create
    @service = Service.new(params[:service])

    puts "========================"
    puts params[:service]

    respond_to do |format|
      if @service.save

SELECT `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
---
  def update
    @service = Service.find(params[:id])