app/controllers/sessions_controller.rb

  def create
    old_id = session[:user_id]
    @msg = ""
    user = User.authenticate(params[:username], params[:password])
    if user
      if user.activateCode == -1 then
        session[:user_id] = user.id
        redirect_to :root
        old_user = User.find(old_id)
        histories = old_user.histories
        old_user.destroy
        histories.each do |h|
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `histories` WHERE `histories`.`id` = 2
DELETE FROM `users` WHERE `users`.`id` = 4
SELECT `histories`.* FROM `histories` WHERE (`histories`.user_id = 5)