app/controllers/users_controller.rb

INSERT INTO `users` (`userName`, `email`, `passwordHash`, `passwordSalt`, `activateCode`, `notAnonymus`, `created_at`, `updated_at`) VALUES ('horta', 'jphorta.volt@gmail.com', '$2a$10$HVeIxV9oDhC0/ZltP/9W5e6a2xgAS0cXSg0E///jrwTJk4RTb9FQy', '$2a$10$HVeIxV9oDhC0/ZltP/9W5e', NULL, NULL, '2011-05-30 19:12:37', '2011-05-30 19:12:37')
---
  def create
  #  @user = User.new(params[:user])

  #      if User.find(params[:user_userName]) != nil
   #   render :text => "EXISTS", :layout => false
    #    end

        stuff = {
            :userName => 'string',
            :password => 'string',
            :password_confirmation => 'string',
            :email => 'string'
        }

    stuff[:userName] = params[:user_userName]
    stuff[:password] = params[:user_password]
    stuff[:password_confirmation] = params[:user_password_confirmation]
    stuff[:email] = params[:user_email]
    puts stuff
 #   stuff = [ params[:user_userName], params[:user_password],params[:user_password_confirmation],params[:user_email]  ]

    @user = User.new(stuff)
    puts stuff
    puts 'uz'
    puts params
    puts params[:user]
    puts 'shown'


    if @user.save

UPDATE `users` SET `activateCode` = 1873, `notAnonymus` = 'yes', `passwordSalt` = '$2a$10$VchnCbplC9HROfZDkLRYuO', `passwordHash` = '$2a$10$VchnCbplC9HROfZDkLRYuOFYx27Vua6bZk5ccpZhyjGmEXT84cCda', `updated_at` = '2011-05-30 19:12:37' WHERE `users`.`id` = 2
---
      @rand = rand(20000)
      @user[:activateCode] = @rand
      @user[:notAnonymus] = "yes"
      @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `activateCode` = -1, `updated_at` = '2011-05-23 22:16:31' WHERE `users`.`id` = 3
---
  def activate

    code = params[:code]
    id = params[:id]
    @user = User.find(id)

    if code == @user.activateCode.to_s then
      @user[:activateCode] = -1
      @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 'user_id' LIMIT 1
SELECT `histories`.* FROM `histories` WHERE `histories`.`limit` = 7 AND (`histories`.user_id = 1) ORDER BY time
---
  def history

    if session[:user_id] != nil then

      address = get_address

      @start = (params[:start] || '1').to_i
      @end = (params[:end] || '10').to_i
      @next = address + "history?start=" + (@end+1).to_s + "&end=" + (@end+1+@end-@start).to_s
      user = User.find(session[:user_id])

      if user.notAnonymus != nil
        @logged = "true"
      else @logged = "false"
      end

      history = user.histories.find(:all, :order =>"time DESC", :offset =>@start.to_i-1, :limit => @end.to_i)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `services`.* FROM `services` WHERE `services`.`serviceName` = 'people'
---
  def sendresource

  if session[:user_id] != nil
    user = User.find(session[:user_id])
    if user.notAnonymus != nil

      urlraw = params[:url]
      urlarray = urlraw.split('/')
      service = Service.where(:serviceName => urlarray[4])